In [1]:
# import pandas library
import pandas as pd

In [2]:
# create a list of data
data = [1,2,3,4,5,10]
print(data)

[1, 2, 3, 4, 5, 10]

In [3]:
# type of data
type(data)

list

In [4]:
# create series
s = pd.Series(data)
s

0     1
1     2
2     3
3     4
4     5
5    10
dtype: int64

In [5]:
type(s)

pandas.core.series.Series

In [8]:
# create a dataframe from the series
df = pd.DataFrame(s, columns=['Number'])
df

   Number
0       1
1       2
2       3
3       4
4       5
5      10

In [11]:
# create a data frame from list
df1 = pd.DataFrame(data, columns=['Number'])
df1.head(2)

   Number
0       1
1       2

In [13]:
type(df1)

pandas.core.frame.DataFrame

In [12]:
# DataFrame to series
s2 = df1['Number']
s2

0     1
1     2
2     3
3     4
4     5
5    10
Name: Number, dtype: int64

In [14]:
type(s2)

pandas.core.series.Series

In [16]:
# create a series from 2 columns
data=[[1,2],[5,6],[8,9]]
data

[[1, 2], [5, 6], [8, 9]]

In [ ]:
df = pd.DataFrame(data, columns=['value1', 'value2'])
df
# 3 row 2 columns

   value1  value2
0       1       2
1       5       6
2       8       9

In [22]:
s = df[['value1', 'value2']]
print(s)

   value1  value2
0       1       2
1       5       6
2       8       9

In [ ]:
# Dictionary
data = {
    'name':['Joe', 'Adam', 'Buddy'],
    'age': [25,34,26],
    'city':['Bangkok', 'Denver', 'Mumbai']
}
data

{'name': ['Joe', 'Adam', 'Buddy'],
 'age': [25, 34, 26],
 'city': ['Bangkok', 'Denver', 'Mumbai']}

In [25]:
# Dictionary to Series
name_series =pd.Series(data['name'], name='Name')
name_series

0      Joe
1     Adam
2    Buddy
Name: Name, dtype: object

In [27]:
df = pd.DataFrame(data)
df

    name  age     city
0    Joe   25  Bangkok
1   Adam   34   Denver
2  Buddy   26   Mumbai

In [28]:
age_series = df[['age']]
age_series

   age
0   25
1   34
2   26

In [30]:
# Set 
s1 = {1,4,5,2,6,8,10}
s1

{1, 2, 4, 5, 6, 8, 10}

In [33]:
# set to series
s = pd.Series(list(s1))
s

0     1
1     2
2     4
3     5
4     6
5     8
6    10
dtype: int64

In [34]:
df = pd.DataFrame(s1)
df

    0
0   1
1   2
2   4
3   5
4   6
5   8
6  10